console.log(`Самооценка 123 / 160  \n
Итого 123 \n
*Вёрстка соответствует макету. Ширина экрана 1024px +36*
Блок header +4
Секция Welcome +4
Секция Visiting +4
Секция Explore +2
Секция Video +4
Секция Gallery +2
Секция Tickets +4
Форма покупки билетов +4
Секция Contacts +4
Блок footer +4
\n
*Вёрстка соответствует макету. Ширина экрана 768px +20*
Блок header +2
Секция Welcome +2
Секция Visiting +2
Секция Explore +2
Секция Video +2
Секция Gallery +2
Секция Tickets +2
Форма покупки билетов +2
Секция Contacts +2
Блок footer +2
\n
*Вёрстка соответствует макету. Ширина экрана 420px +32*
Блок header +4
Секция Welcome +4
Секция Visiting +2
Секция Explore +4
Секция Video +2
Секция Gallery +2
Секция Tickets +4
Форма покупки билетов +2
Секция Contacts +4
Блок footer +4
\n
*Ни на одном из разрешений до 320px включительно не появляется горизонтальная полоса прокрутки +6*
*Совмещается адаптивная и респонсивная (резиновая) вёрстка +14 *
слайдера в секции Welcome +2
слайдера сравнения изображений в секции Explore +2
кастомного видеоплеера в секции Video +2
слайдера в секции Video +2
YouTube-видео в плейлисте в секции Video, маленькие видео выровнены по краям большого +2
галереи изображений и изображений в ней +2
карты +2
\n
*На ширине экрана 1024рх и меньше реализовано адаптивное меню +11*
при нажатии на бургер-иконку меню появляется, плавно выдвигаясь слева, бургер-иконка изменяется на крестик. При нажатии на крестик меню исчезает, плавно возвращаясь назад, иконка крестика превращается в бургер-иконку +2
ссылки в меню работают, обеспечивая плавную прокрутку по якорям +2
при клике по ссылке в адаптивном меню, или при клике по любому месту сайта, кроме самого адаптивного меню, меню закрывается +1
вёрстка меню соответствует макету на всех проверяемых разрешениях +6
\n
*Оптимизация скорости загрузки страницы +4*
50 to 89 (orange): Needs Improvement - частично выполнено +4
`);


