console.log(`Самооценка 155 / 160  \n
Итого 150 \n

[+] Вёрстка валидная +10 \n
[+] <header>, <main>, <footer> +2
[+] семь элементов <section> (по количеству секций) +2
[+] только один заголовок <h1> +2
[+] семь заголовков <h2> (по количеству секций) +2
[+] шесть заголовков <h3> (по количеству карточек) +2
[+] два элемента <nav> (основная и вспомогательная панель навигации) +2
[+] три списка ul > li > a (основная и вспомогательная панель навигации, ссылки на соцсети) +2
[+] тринадцать кнопок button (четыре из них в секции Video, пять в секции Tickets, по две - стрелки слайдера и плейлиста) +2
[+] три тега input type="radio" (в секции Tickets) +2
[+] два тега input type="number"(в секции Tickets) +2
[+] два тега input type="range" (громкось и прогрес-бар видео) +2
[+] для всех элементов <img> указан обязательный атрибут alt +2 \n
Вёрстка соответствует макету - Расхождения в пределах 10px
[+] блок <header> +5
[+] секция Welcome +5
[+] секция Visiting +5
[+] секция Explore +5
[+] секция Video +5
[+] секция Gallery +5
[+] секция Tickets +5
[+] секция Contacts +5
[+] блок <footer> +5 \n
Форма покупки билетов 
[+-] форма плавно выдвигается слева при открытии и плавно возвращается назад при закрытии. В открытом состоянии под формой есть полупрозрачный overlay, который занимает весь экран. Форма и overlay прокручиваются вместе со страницей +1 
[+] форма открывается при клике по кнопке Buy Now в секции Tickets и закрывается кликом по иконке с крестиком в верхнем правом углу или кликом по overlay +2
[+] при вёрстке формы используются следующие элементы: form, input type="date", input type="time", input type="text", input type="email", input type="tel", input type="number", select +8
[+-] вёрстка формы соответствует макету + 6 \n
Требования к css
[+] добавлен favicon +2
[+] для построения сетки используются флексы или гриды +2
[+] при уменьшении масштаба страницы браузера вёрстка размещается по центру, а не сдвигается в сторону +2
[+] фоновый цвет каждого блока и секции тянется на всю ширину страницы +2
[+] иконки добавлены в формате .svg. SVG может быть добавлен любым способом +2
[+] расстояние между буквами, там, где это требуется по макету, регулируется css-свойством letter-spacing +2
[+] переключаются радиокнопки в блоке Tickets, одновременно может быть выбрана только одна кнопка +2
[+] в блоке Contacts правильно указанны ссылки на почту mailto и на телефон tel +2
[+] в футере добавлены ссылки на соцсети. Круглая граница вокруг иконок соцсетей выполнена при помощи css +2 \n
Интерактивность, реализуемая через css
[+] плавная прокрутка по якорям +5
[+] параллакс +5
[+] при кликам по кнопке Discover the Louvre и карточкам секции Visiting открываются полноэкранные панорамы Google встроенные в страницы при помощи iframe +5 \n
Изменение стиля интерактивных элементов при наведении и клике
[+] интерактивность включает в себя не только изменение внешнего вида курсора +4
[+] плавное изменение внешнего вида элемента при наведении и клике не влияющее на соседние элементы +2
[+] при наведении карточек в Visiting плавное растягивание подчёркивания заголовка карточки на всю ширину карточки +2
[+] при наведении иконок социальных сетей в футере изменение цвета иконки и круглой границы вокруг иконки на золотистый +2 \n
Интерактивность, реализуемая через js
[+] можно передвигать ползунки громкости и прогресс-бар видео, при этом цвет шкалы до и после ползунка отличается и соответствует макету +2
[+] кликами по кнопкам + и - в секции Tiskets можно менять количество билетов Basic и Senior от 0 до 20 +2
[+] кнопке "Book" в форме покупки билетов добавлен ripple-эффект 
[+] при перезагрузке (обновлении) страницы картины в блоке Galery отображаются в рандомном порядке +10
`);
