console.log(`Самооценка 154 / 160  \n
Итого: 154 \n
Вёрстка соответствует макету. Ширина экрана 1024px +40
\n
Вёрстка соответствует макету. Ширина экрана 768px +40
\n
Вёрстка соответствует макету. Ширина экрана 420px +40
\n
Ни на одном из разрешений до 320px включительно не появляется горизонтальная полоса прокрутки +6
\n
Совмещается адаптивная и респонсивная (резиновая) вёрстка +14
\n
На ширине экрана 1024рх и меньше реализовано адаптивное меню +10
 - не выполнено: при клике по ссылке в адаптивном меню, или при клике по любому месту сайта, кроме самого адаптивного меню, меню закрывается 0
 \n
 Оптимизация скорости загрузки страницы +4
 - частично: 50 to 89 (orange)
`);
