console.log(`Самооценка 58 / 160  \n
Итого: 58 \n
Анимация при прокрутке изображений в секции Galery +8
[+] при прокрутке страницы вниз появление картин секции Galery сопровождается анимацией: изображения плавно поднимаются снизу вверх, увеличиваясь и создавая эффект выплывания +4
[+] если прокрутить страницу вверх и затем снова прокручивать вниз, анимация появления картин повторяется +2
[+] при обновлении страницы анимация картин повторяется +2
\n
Валидация формы +16
[+] валидация имени пользователя +4
[+] валидация e-mail  +4
[+] валидация номера телефона +4
[+] при вводе в input невалидного значения, его граница подсвечивается красным, выводится текстовое предупреждение в человекочитаемом формате +4
\n
Калькулятор продажи билетов в секции Tiskets +8:
[+] при изменении количества билетов Basic и Senior пересчитывается общая цена +4
[+] у каждого типа билетов своя цена. При изменении типа билета пересчитывается общая цена +4
[-] при обновлении страницы сохраняется выбранное ранее количество билетов, тип билета, общая цена +0
\n
Калькулятор продажи билетов в форме продажи билетов +14
[+] по кнопке Buy now открывается форма, она содержит данные, указанные на странице сайта +2
[+] когда пользователь выбирает дату в форме слева, она отображается в билете справа +2
[+] нельзя выбрать дату в прошлом +2
[+] когда пользователь выбирает время в форме слева, оно отображается в билете справа +2
[+] время можно выбирать с 9:00 до 18:00 с интервалом в 30 минут +2
[+] можно изменить тип билета в поле Ticket type слева при этом меняется тип билета, цена билета и общая стоимость билетов справа +2
[+] можно изменить количество билетов каждого типа в поле слева при этом меняется количество билетов и общая стоимость билетов справа +2
\n
Интерактивная карта в секции Contacts +12
[+] в секции Contacts добавлена интерактивная карта +4
[+] на карте отображаются маркеры, расположение и внешний вид маркеров соответствует макету +4
[+] стиль карты соответствует макету +4
\n

`);
